# словарь
# неупорядоченная 'изменяемая' коллекция данных
# key - value
# key - все неизменяемые типы данных

# простые - int, float, str, bool
# сложные - tuple

from pprint import pprint

# список - []
# кортеж (tuple) = ()
# множество и словарь(!!!) тоже {1,2,3,4}

'''
{ 
    1 : 1, 
    2 : 'два', 
    3 : '3' 
}
'''
#

# if ... : else: elif ...:
# for ... :
# while ... :
# match :
# case ... :
# :=  ?


d1 = dict()
d2 = {}  # не путать с set

d3 = {
    'red': 5,
    'blue': 10,
    0: 'ноль',
    False: 'ничего нет',
    (6, 7): "выходные",
    3.14: [
        'пи',
        [1, 2, 3],
        {1, 2, 3},
        {
            1: 'один'
        }
    ]

}

print(d3['red'])
print(d3[0])
print(d3[False])
print(d3[(6, 7)])
print(d3[(3.14)][-1][1]) # один
