books = (
    ("Евгений Онегин", "Пушкин А.С.", 200),
    ("Муму", "Тургенев И.С.", 500),
    ("Мастер и Маргарита", "Булгаков М.А.", 500),
    ("Мертвые души", "Гоголь Н.В.", 190)
)

#  отсортировать по цене (последнее значение)

# решение в чат 1-2 мин

books = sorted(books, key = lambda word: (word[-1], word[0]) )


# print(*books, sep='\n')



S = [
    [47, 470], # Вес за мешок и стоимость
    [50, 600],
    [60, 480],
    [45, 540],
    [30, 300]
]

# Отсортировать мешки по стоимости за кг,
# при равной стоимости первыми идут мешки с наименьшим весом

S.sort(key=lambda x: (x[-1]/ x[0], x[0]))
print(*S, sep='\n')

# prices = []
# for x in S:
#     prices.append([x[1] ,  x[0], x[1] /  x[0]])
#
# # print(*prices, sep='\n')
#
# prices.sort(key=lambda x:(x[2],x[1]))
# print('-' * 30)
#
# print(*prices, sep='\n')